AccumulationRegisters/ЛБ_ДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДвиженияДенежныхСредств</Name>
			<Comment>Денежные средства по назначению платежа</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийПКО</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийРКО</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДУЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КорпоративныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Comment>Ломбард</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Comment>Вид денежных средств</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДвиженияДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДвиженияДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацииКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассоваяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ПротоколРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПротоколРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ДействияПользователя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КассовыеЛимиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КассовыеЛимиты</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РассчетныйЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийПКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоЗайму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоЗаймуПереоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплатыПоЗаймуПереоформлению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеИзКассыДругогоЛомбарда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеИзЦентральнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСКорпоративнойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеИзлишков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗарплатыПоОшибке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеУщербаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеУщербаУволеннымСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеНедостачиСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеНедостачиУволеннымСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходныеОперацииПоСогласованиюСЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПриходныеОперацииПоСогласованиюСЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступленияОтПокупателейНевостребованныхЗалогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводныйПКО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийРКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаПереоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПроцентовПоЗаявке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратРазницыРеализацииНевостребованногоЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЦентральнуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВКассуЛомбарда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДляСдачиНаРасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДляЗачисленияНаКорпоративнуюКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДепонированнойЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходныеОперацииПоСогласованиюСЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходныеОперацииПоСогласованиюСЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводныйРКО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_КассоваяСменаСтатус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_КассоваяСменаСтатус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассовыйДеньЗакрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийКассовойСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытьКассовыйДень</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ДействияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ДействияПользователя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ЖурналКассовыхОпераций/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаКон = ТекущаяДатаСеанса();
	ДатаНач = ДатаКон;
	Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	Ломбард = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь); 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
   		Ответственный = ТекПользователь; 
		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
			СотрудникЦО = Истина;
		КонецЕсли;
	Иначе
		Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;	
	
	КассовыеОперации.Параметры.УстановитьЗначениеПараметра("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));
	КассовыеОперации.Параметры.УстановитьЗначениеПараметра("Дата2", ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон)));
    КассовыеОперации.Параметры.УстановитьЗначениеПараметра("Организация", Организация); 
	КассовыеОперации.Параметры.УстановитьЗначениеПараметра("Ломбард", Ломбард); 
	СписокОперацийОтмены = Новый СписокЗначений;
	СписокОперацийОтмены.Добавить(Перечисления.ЛБ_ВидыОперацийПКО.ОтменаОплатыПоЗаймуПереоформлению);
	СписокОперацийОтмены.Добавить(Перечисления.ЛБ_ВидыОперацийРКО.ОтменаВыдачиЗайма);
	
	КассовыеОперации.Параметры.УстановитьЗначениеПараметра("СписокОтмена", СписокОперацийОтмены);
	
	ОстаткиПоКассе();                   
	ОбновитьИнформациюИтого();
	ОбновитьИнформациюКассовойСмены(); 
	
	//+МАН 12.02.26
	ОбновитьКассовыйЛимит();
	//-МАН
	
	//+МАН 19.03.26 Заявка 3750
	УстановитьДоступность();
	//-МАН
КонецПроцедуры     

&НаСервере
Процедура ОбновитьИнформациюКассовойСмены()  
	ДатаПроверки = ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон));
	Результат = ЛБ_ОбщийМодуль.ПолучитьТекущийСтатусКассовойСмены(ДатаПроверки, Организация, Ломбард);
	Если Результат = неопределено Тогда 
		Элементы.ИнформацияКС.Заголовок = "Информация о кассовых сменах отсутствует"; 
	Иначе	      
		СтатусКС = Результат.Статус;   
		Если  НЕ (НачалоДня(Результат.Дата) = НачалоДня(ДатаКон)) Тогда 
			Элементы.ИнформацияКС.Заголовок = "Информация о кассовых сменах на " + Формат(ДатаКон, "ДФ=dd.MM.yyyy") + " отсутствует";  
		Иначе	
			Если СтатусКС = Перечисления.ЛБ_КассоваяСменаСтатус.Открыта  тогда  
				Элементы.ИнформацияКС.Заголовок = "Открыта кассовая смена " + Формат(Результат.Дата, "ДЛФ=DT") + ", кассир " + СокрЛП(Результат.Ответственный);	
			ИначеЕсли СтатусКС = Перечисления.ЛБ_КассоваяСменаСтатус.Закрыта  тогда 
				Элементы.ИнформацияКС.Заголовок = "Закрыта кассовая смена " + Формат(Результат.Дата, "ДЛФ=DT") + ", кассир " + СокрЛП(Результат.Ответственный);  		
			КонецЕсли;	 
		КонецЕсли;	
	КонецЕсли;	 
	Результат = ЛБ_ОбщийМодуль.ПолучитьЗакрытыйКассовыйДень(ДатаПроверки, Организация, Ломбард); 
	ДоступностьЗакрытьКассовыйДень = Истина;
	Если Результат = неопределено Тогда 
		Элементы.ИнформацияКД.Заголовок = "Информация о закрытом кассовом дне отсутствует";
	Иначе	      
		Если НЕ (НачалоДня(Результат.Дата) = НачалоДня(ДатаКон)) Тогда 
			Элементы.ИнформацияКД.Заголовок = "Информация о закрытом кассовом дне " + Формат(ДатаКон, "ДФ=dd.MM.yyyy") + " отсутствует";
		Иначе	
    	    Элементы.ИнформацияКД.Заголовок = "Закрыт кассовый день " + Формат(Результат.КассовыйДень, "ДЛФ=D") + ", дата закрытия " + Формат(Результат.Дата, "ДЛФ=DT") + ", кассир " + СокрЛП(Результат.Ответственный);
			ДоступностьЗакрытьКассовыйДень = Ложь;
		КонецЕсли;	
	КонецЕсли;	 
	Элементы.ФормаЗакрытьКассовыйДень.Доступность = ДоступностьЗакрытьКассовыйДень;
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюИтого() 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));
	Запрос.УстановитьПараметр("Дата2", ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон)));
    Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбард", Ломбард); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДвиженияДенежныхСредств.Регистратор КАК Регистратор,
	               |	ЛБ_ДвиженияДенежныхСредств.КассоваяОперация КАК КассоваяОперация,
	               |	ЛБ_ДвиженияДенежныхСредств.ВидОперации КАК ВидОперации
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
	               |ГДЕ
	               |	ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
	               |	И ЛБ_ДвиженияДенежныхСредств.Ломбард = &Ломбард
	               |	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
	               |	И ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &Дата1 И &Дата2";   
	ИтогоКО	= 0;
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Для каждого Выборка из ТаблицаЗапроса Цикл 
		Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_ОтменаПКО") ИЛИ
			 ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЛБ_ОтменаРКО") Тогда
			Отбор = новый Структура;
			Отбор.Вставить("Регистратор", Выборка.КассоваяОперация);
			Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				ИтогоКО = ИтогоКО - 1;
			Иначе                  
				ИтогоКО = ИтогоКО + 1;
			КонецЕсли;	           
		ИначеЕсли Выборка.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОтменаОплатыПоЗаймуПереоформлению ИЛИ 
			      Выборка.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ОтменаВыдачиЗайма Тогда   
			ИтогоКО = ИтогоКО - 1;
		Иначе	
		    ИтогоКО = ИтогоКО + 1;      
		КонецЕсли;	
	КонецЦикла;
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьНомерКассовогоЛиста(ДатаНач, ДатаКон, Организация, Ломбард);
	НомерКЛ = Результат.Номер; 
	Элементы.НомерКЛ.Заголовок = СокрЛП(Ломбард.НомерЛомбарда) + "/" + ?(НомерКЛ = 0, "", Строка(НомерКЛ));
	Элементы.ДатаКЛ.Заголовок = "от " + Формат(Результат.Дата, "ДФ=dd.MM.yyyy");
КонецПроцедуры


&НаСервере
Процедура ДинамическийСписокВТаблицуЗначений()

	//Получаем схема компановки данных (здесь хранится текст запроса)
	Схема = Элементы.КассовыеОперации.ПолучитьИсполняемуюСхемуКомпоновкиДанных();

	//Получаем настройки пользователя (отборы, сортировки и т.п.)
	Настройки = Элементы.КассовыеОперации.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();

	//Выводим динамический список в таблицу значений
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ТаблицаКО.Загрузить(ТЗ);	
	
	Остаток = СуммаНач;
	Для каждого Стр Из ТаблицаКО Цикл
		Остаток = Остаток = Стр.Приход - Стр.Расход;
		Стр.Остаток = Остаток;
	Конеццикла;	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаСервере
Функция ПроверитьОперацияСЧеком(Документ)
	Если Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОприходованиеИзлишков ИЛИ 
		 Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПриходныеОперацииПоСогласованиюСЦО ИЛИ
		 Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратПроцентов ИЛИ 
		 Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратПроцентовПоЗаявке ИЛИ
		 Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратРазницыРеализацииНевостребованногоЗалога ИЛИ
		 Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.РасходныеОперацииПоСогласованиюСЦО Тогда  
	    Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция ПолучитьТипДокумента(Документ)
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЛБ_ПриходныйКассовыйОрдер") Тогда 
		Если Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.СводныйПКО Тогда
			Возврат 0;
		Иначе	
		    Возврат 1;  
		КонецЕсли;	
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЛБ_РасходныйКассовыйОрдер") Тогда 
		Если Документ.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.СводныйРКО Тогда
			Возврат 0;
		Иначе	
		    Возврат 2;  
		КонецЕсли;	  
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЛБ_ОтменаПКО") Тогда 
	     Возврат 3; 
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЛБ_ОтменаРКО") Тогда 
	     Возврат 4; 	 
    Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура КассовыеОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.КассовыеОперации.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  
		ПараметрыФормы = Новый Структура;
	    ПараметрыФормы.Вставить("Ключ", ТекСтрока.Регистратор);
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);     
		Если ПолучитьТипДокумента(ТекСтрока.Регистратор) = 1 Тогда
		    ОткрытьФорму("Документ.ЛБ_ПриходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли ПолучитьТипДокумента(ТекСтрока.Регистратор) = 2 Тогда
		    ОткрытьФорму("Документ.ЛБ_РасходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		ИначеЕсли ПолучитьТипДокумента(ТекСтрока.Регистратор) = 3 Тогда
		    ОткрытьФорму("Документ.ЛБ_ОтменаПКО.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	    ИначеЕсли ПолучитьТипДокумента(ТекСтрока.Регистратор) = 4 Тогда
		    ОткрытьФорму("Документ.ЛБ_ОтменаРКО.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияОперации(Результат, ДопПараметры) Экспорт 
	Элементы.КассовыеОперации.Обновить();
	ОстаткиПоКассе();   
	ОбновитьИнформациюИтого();
	ОбновитьИнформациюОстатокОперации();
	//+МАН 12.02.26
	ОбновитьКассовыйЛимит();
	ПроверитьПревышениеЛимита();
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	КассовыеОперации.Параметры.УстановитьЗначениеПараметра("Дата1", НачалоДня(ДатаНач));	
	Элементы.КассовыеОперации.Обновить(); 
	ОстаткиПоКассе();
	ОбновитьИнформациюИтого();
	ОбновитьИнформациюОстатокОперации(); 
	ОбновитьИнформациюКассовойСмены() 
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)  
	Если НЕ ДатаКон = Дата(1,1,1) И НЕ ДатаНач = Дата(1,1,1) Тогда
		Если  ДатаКон < ДатаНач Тогда
			Предупреждение("Конечная дата выбранного периода не может быть больше начальной даты периода.", 60);
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	КассовыеОперации.Параметры.УстановитьЗначениеПараметра("Дата2", ?(ДатаКон = Дата(1,1,1), ДатаКон, КонецДня(ДатаКон)));
 	Элементы.КассовыеОперации.Обновить(); 
	ОстаткиПоКассе();      
	ОбновитьИнформациюИтого();
	ОбновитьИнформациюОстатокОперации(); 
	ОбновитьИнформациюКассовойСмены();
	//+МАН 12.02.26
	ОбновитьКассовыйЛимит();
	ПроверитьПревышениеЛимита();
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент) 
	КассовыеОперации.Параметры.УстановитьЗначениеПараметра("Организация", Организация); 
	Элементы.КассовыеОперации.Обновить();
	ОстаткиПоКассе();       
	ОбновитьИнформациюИтого();
	ОбновитьИнформациюОстатокОперации(); 
	ОбновитьИнформациюКассовойСмены();
	//+МАН 12.02.26
	ОбновитьКассовыйЛимит();
	ПроверитьПревышениеЛимита();
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	КассовыеОперации.Параметры.УстановитьЗначениеПараметра("Ломбард", Ломбард);
	Элементы.КассовыеОперации.Обновить();
	ОстаткиПоКассе();  
	ОбновитьИнформациюИтого();
	ОбновитьИнформациюОстатокОперации(); 
	ОбновитьИнформациюКассовойСмены();
	//+МАН 12.02.26
	ОбновитьКассовыйЛимит();
	ПроверитьПревышениеЛимита();
	//-МАН
КонецПроцедуры

&НаСервере
Функция ПроверитьКассовыйДеньЗакрыт(Документ = неопределено) 
	СтруктураВозврата = Новый Структура;
	Если Документ = неопределено Тогда
		ДатаПроверки = ?(СотрудникЦО, ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон)), ТекущаяДатаСеанса());
	Иначе
		ДатаПроверки = КонецДня(Документ.Дата);
	КонецЕсли;	  
	Результат = ЛБ_ОбщийМодуль.ПолучитьЗакрытыйКассовыйДень(ДатаПроверки, Организация, Ломбард); 
	Если НЕ Результат = неопределено Тогда  
		Если Результат.КассовыйДень = НачалоДня(ДатаКон) Тогда        		
			СтруктураВозврата.Вставить("Результат", Истина);
			СтруктураВозврата.Вставить("Сообщение", "Кассовый день " + Формат(ДатаПроверки, "ДФ=dd.MM.yyyy") + " закрыт.");
			Возврат СтруктураВозврата;    
  		КонецЕсли;
	КонецЕсли;	

	СтруктураКС = ЛБ_ОбщийМодуль.ПолучитьТекущийСтатусКассовойСмены(ДатаПроверки, Организация, Ломбард); 
	Если СтруктураКС = неопределено Тогда 
		СтруктураВозврата.Вставить("Результат", Истина);
		СтруктураВозврата.Вставить("Сообщение", "Кассовая смена не открыта.");
		Возврат СтруктураВозврата;
	ИначеЕсли СтруктураКС.Статус = Перечисления.ЛБ_КассоваяСменаСтатус.Закрыта Тогда
			СтруктураВозврата.Вставить("Результат", Истина);
			СтруктураВозврата.Вставить("Сообщение", "Кассовая смена закрыта.");
			Возврат СтруктураВозврата;       
	КонецЕсли;	
	СтруктураВозврата.Вставить("Результат", Ложь);
	Возврат СтруктураВозврата;
КонецФункции

&НаСервере 
Функция ПолучитьДатуСеанса() 
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ДобавитьПриход(Команда) 
	СтруктураВ = ПроверитьКассовыйДеньЗакрыт();
	Если СтруктураВ.Результат Тогда   
		Предупреждение(СтруктураВ.Сообщение, 60);
		Возврат;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Ломбард", Ломбард);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_ПриходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьРасход(Команда)
	СтруктураВ = ПроверитьКассовыйДеньЗакрыт();
	Если СтруктураВ.Результат Тогда   
		Предупреждение(СтруктураВ.Сообщение, 60);
		Возврат;
	КонецЕсли;	 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Ломбард", Ломбард);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_РасходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция УдалитьНаСервере(Документ)  
	СтруктураВ = новый структура;
	ДокОбъект = Документ.ПолучитьОбъект();  
	ТипДок = ПолучитьТипДокумента(Документ);
	Если ТипДок = 1 Или ТипДок = 2 Тогда 
		СтруктураРез = ПроверитьКассовыйДеньЗакрыт(ДокОбъект);
		Если СтруктураРез.Результат И ДокОбъект.Проведен Тогда  
			СтруктураВ.Вставить("Результат", Ложь);
			СтруктураВ.Вставить("Сообщение", СтруктураРез.Сообщение); 
			Возврат СтруктураВ;
		КонецЕсли;	
		Если ДокОбъект.Проведен И (ТекущаяДатаСеанса() - ДокОбъект.Дата) > 3600 Тогда
			СтруктураВ.Вставить("Результат", Ложь);
			СтруктураВ.Вставить("Сообщение", "Удаление документа возможно только в течение часа с момента создания!"); 
			Возврат СтруктураВ;
		КонецЕсли;
	КонецЕсли;	
	Пометка = ?(ДокОбъект.ПометкаУдаления, Ложь, Истина);
	ДокОбъект.УстановитьПометкуУдаления(Пометка);  
	СтруктураВ.Вставить("Результат", Истина);   
	Возврат СтруктураВ;
КонецФункции

&НаКлиенте
Процедура Удалить(Команда)
    ТекСтрока = Элементы.КассовыеОперации.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  
		Если НЕ ПолучитьТипДокумента(ТекСтрока.Регистратор) = 0 Тогда 
			Если ПроверитьПроведен(ТекСтрока.Регистратор) И ПроверитьОперацияСЧеком(ТекСтрока.Регистратор) Тогда
				Предупреждение("Для проведенного документа с чеком удаление запрещено.", 60);
				Возврат;
			КонецЕсли;	

			СтруктураВ = УдалитьНаСервере(ТекСтрока.Регистратор);
			Если СтруктураВ.Результат Тогда
				Элементы.КассовыеОперации.Обновить();   
				ОстаткиПоКассе();
				ОбновитьИнформациюИтого();
				ОбновитьИнформациюОстатокОперации();  
				//+МАН 12.02.26
				ПроверитьПревышениеЛимита();
				//-МАН
			Иначе
				Предупреждение(СтруктураВ.Сообщение, 60);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Копировать(Команда)     
	ТекСтрока = Элементы.КассовыеОперации.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда 
		ПараметрыФормы = Новый Структура;
	    ПараметрыФормы.Вставить("КопироватьИзДокумента", ТекСтрока.Регистратор);
		
		СтруктураРез = ПроверитьКассовыйДеньЗакрыт(ТекСтрока.Регистратор);
     	Если СтруктураРез.Результат Тогда 
			Предупреждение(СтруктураРез.Сообщение, 60);
			Возврат;
		КонецЕсли;	
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);     
		Если ПолучитьТипДокумента(ТекСтрока.Регистратор) = 1 Тогда 
			//Если ПроверитьОперацияСЧеком(ТекСтрока.Регистратор) Тогда
			//	Предупреждение("Для документа с чеком копирование запрещено.", 60);
			//	Возврат;
			//КонецЕсли;	
		    ОткрытьФорму("Документ.ЛБ_ПриходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
		ИначеЕсли ПолучитьТипДокумента(ТекСтрока.Регистратор) = 2 Тогда 
			//Если ПроверитьОперацияСЧеком(ТекСтрока.Регистратор) Тогда
			//	Предупреждение("Для документа с чеком копирование запрещено.", 60);
			//	Возврат;
			//КонецЕсли;	
		    ОткрытьФорму("Документ.ЛБ_РасходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
		Иначе
			Предупреждение("Возможно копирование только приходного или расходного кассового ордера.", 60);
		КонецЕсли;	
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПровестиНаСервере(Документ) 
	СтруктураВ = новый структура;  
	ДокОбъект = Документ.ПолучитьОбъект(); 
	Если ДокОбъект.ПометкаУдаления Тогда
		СтруктураВ.Вставить("Результат", Ложь);
		СтруктураВ.Вставить("Сообщение", "Помеченный на удаление документ не может быть проведен!"); 
		Возврат СтруктураВ;
	КонецЕсли;	 
	//Если ПроверитьКассовыйДеньЗакрыт() Тогда  
	//	Если НЕ ДокОбъект.Проведен Тогда 
	//		СтруктураВ.Вставить("Результат", Ложь);
	//		СтруктураВ.Вставить("Сообщение", "Кассовый день " + Формат(ПолучитьДатуСеанса(), "ДФ=dd.MM.yyyy") + " закрыт."); 
	//		Возврат СтруктураВ;
	//	КонецЕсли;	
	//КонецЕсли;
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		СтруктураВ.Вставить("Результат", Истина); 
		Возврат СтруктураВ;
	Исключение  
		СтруктураВ.Вставить("Результат", Ложь);
		СтруктураВ.Вставить("Сообщение", "Ошибка проведения, документ не проведен!"); 
		Возврат СтруктураВ;
	КонецПопытки	
КонецФункции

&НаКлиенте
Процедура Провести(Команда)    
	ТекСтрока = Элементы.КассовыеОперации.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  
		Если НЕ ПолучитьТипДокумента(ТекСтрока.Регистратор) = 0 Тогда 
			Если ПроверитьПроведен(ТекСтрока.Регистратор) И ПроверитьОперацияСЧеком(ТекСтрока.Регистратор) Тогда
				Предупреждение("Для документа с чеком перепроведение запрещено.", 60);
				Возврат;
			КонецЕсли;	
			СтруктураВ = ПровестиНаСервере(ТекСтрока.Регистратор);
			Если СтруктураВ.Результат Тогда
				Элементы.КассовыеОперации.Обновить();   
				ОстаткиПоКассе();
				ОбновитьИнформациюИтого();
				ОбновитьИнформациюОстатокОперации();  
				//+МАН 12.02.26
				ПроверитьПревышениеЛимита();
				//-МАН
			Иначе
				Предупреждение(СтруктураВ.Сообщение, 60);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры      

&НаСервере
Функция ОтменитьПроведениеНаСервере(Документ)
	ДокОбъект = Документ.ПолучитьОбъект(); 
	СтруктураВ = новый структура;  
	ТипДок = ПолучитьТипДокумента(Документ);
	Если ТипДок = 1 Или ТипДок = 2 Тогда   
		СтруктураРез = ПроверитьКассовыйДеньЗакрыт(ДокОбъект);
		Если СтруктураРез.Результат Тогда  
			СтруктураВ.Вставить("Результат", Ложь);
			СтруктураВ.Вставить("Сообщение", СтруктураРез.Сообщение); 
			Возврат СтруктураВ;
		КонецЕсли;	

		Если ДокОбъект.Проведен И (ТекущаяДатаСеанса() - ДокОбъект.Дата) > 3600 Тогда
			СтруктураВ.Вставить("Результат", Ложь);
			СтруктураВ.Вставить("Сообщение", "Корректировка документа возможна только в течение часа с момента создания!"); 
			Возврат СтруктураВ;
		КонецЕсли;
	КонецЕсли;
	
	Если ДокОбъект.ПометкаУдаления Тогда
		СтруктураВ.Вставить("Результат", Ложь);
		СтруктураВ.Вставить("Сообщение", "Выбранный документ не проведен!"); 
		Возврат СтруктураВ;
	КонецЕсли;	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
		СтруктураВ.Вставить("Результат", Истина);
		Возврат СтруктураВ;
	Исключение  
		СтруктураВ.Вставить("Результат", Ложь);
		СтруктураВ.Вставить("Сообщение", "Ошибка отмены проведения документа!"); 
		Возврат СтруктураВ;
	КонецПопытки	
КонецФункции

&НаКлиенте
Процедура ОтменитьПроведение(Команда)
 	ТекСтрока = Элементы.КассовыеОперации.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда  
		Если НЕ ПолучитьТипДокумента(ТекСтрока.Регистратор) = 0 Тогда 
			Если ПроверитьПроведен(ТекСтрока.Регистратор) И ПроверитьОперацияСЧеком(ТекСтрока.Регистратор) Тогда
				Предупреждение("Для документа с чеком отмена проведения запрещена.", 60);
				Возврат;
			КонецЕсли;
			СтруктураВ = ОтменитьПроведениеНаСервере(ТекСтрока.Регистратор);
			Если СтруктураВ.Результат Тогда
				Элементы.КассовыеОперации.Обновить();   
				ОстаткиПоКассе();
				ОбновитьИнформациюИтого();
				ОбновитьИнформациюОстатокОперации();  
				//+МАН 12.02.26
				ПроверитьПревышениеЛимита();
				//-МАН
			Иначе
				Предупреждение(СтруктураВ.Сообщение, 60);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТекСтрока = Элементы.КассовыеОперации.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда 
		Если НЕ ТекСтрока.СостояниеДокумента = 1 Тогда  
			Предупреждение("Печать непроведенного документа запрещена!", 60);
			Возврат
		КонецЕсли;	
		Если ПолучитьТипДокумента(ТекСтрока.Регистратор) = 1 Тогда		
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИменаМакетов", "ПКО"); 
			ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ПриходныйКассовыйОрдер");
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ТекСтрока.Регистратор);
			ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
		ИначеЕсли ПолучитьТипДокумента(ТекСтрока.Регистратор) = 2 Тогда     
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИменаМакетов", "РКО"); 
			ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_РасходныйКассовыйОрдер");
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ТекСтрока.Регистратор);
			ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
		ИначеЕсли ПолучитьТипДокумента(ТекСтрока.Регистратор) = 0 Тогда
			Если ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ОплатаПоЗайму") ИЛИ 
				 ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ОплатаПоЗаймуПереоформление") Тогда
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("ИменаМакетов", "ПКО"); 
				ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
				МассивОбъектов = Новый Массив;
				МассивОбъектов.Добавить(ТекСтрока.Регистратор);
				ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
				ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
			ИначеЕсли ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаЗайма") ИЛИ 
				 ТекСтрока.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаЗаймаПереоформление") Тогда
                ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("ИменаМакетов", "РКО"); 
				ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ОперацияПоЗалогу");
				МассивОбъектов = Новый Массив;
				МассивОбъектов.Добавить(ТекСтрока.Регистратор);
				ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
				ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
			КонецЕсли;	 
		КонецЕсли;	
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОстаткиПоКассе()  
	//+МАН 03.12.24 Добавлена проверка дат. Заявка 2904
	Если НачалоДня(ДатаНач) > КонецДня(ДатаКон) Тогда
		Сообщить("Неправильно задан период: начало периода должно быть меньше или равно окончанию!", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	//-МАН
	
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));  
	Запрос.УстановитьПараметр("Дата2", ?(ДатаКон = Дата(1,1,1), ДатаКон, КонецДня(ДатаКон)));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДенежныеСредстваОстаткиИОбороты.Ломбард КАК Ломбард,
	               |	СУММА(ЛБ_ДенежныеСредстваОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНач,
	               |	СУММА(ЛБ_ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКон,
	               |	СУММА(ЛБ_ДенежныеСредстваОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	               |	СУММА(ЛБ_ДенежныеСредстваОстаткиИОбороты.СуммаРасход) КАК СуммаРасход
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ДенежныеСредства.ОстаткиИОбороты(
	               |			&Дата1,
	               |			&Дата2,
	               |			,
	               |			,
	               |			Организация = &Организация
	               |				И ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
	               |				И Ломбард = &Ломбард) КАК ЛБ_ДенежныеСредстваОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ДенежныеСредстваОстаткиИОбороты.Ломбард";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		СуммаНач = Выборка.СуммаНач;
		СуммаКон = Выборка.СуммаКон; 
		СуммаПриход = Выборка.СуммаПриход;
		СуммаРасход = Выборка.СуммаРасход;
	Иначе
		СуммаНач = 0;
		СуммаКон = 0; 
		СуммаПриход = 0;
		СуммаРасход = 0;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ОстатокНаДатуОперации(Дата) 
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДенежныеСредстваОстатки.Ломбард КАК Ломбард,
	               |	СУММА(ЛБ_ДенежныеСредстваОстатки.СуммаОстаток) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ДенежныеСредства.Остатки(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Ломбард = &Ломбард
	               |				И ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)) КАК ЛБ_ДенежныеСредстваОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ДенежныеСредстваОстатки.Ломбард"; 
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Возврат Выборка.Сумма;
	КонецЕсли;
	Возврат 0;
КонецФункции

&НаКлиенте
Процедура ОбновитьИнформациюОстатокОперации()
	ТекСтрока = Элементы.КассовыеОперации.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		Остаток = ОстатокНаДатуОперации(ТекСтрока.Дата);  
		Если ТекСтрока.СостояниеДокумента = 1 Тогда 
		    Остаток = Остаток + ТекСтрока.Приход - Текстрока.Расход;  
		КонецЕсли;
		Элементы.ДекорацияОперацияОстаток.Заголовок = Формат(Остаток, "ЧЦ=15; ЧДЦ=2; ЧФ=' Ч  ""руб. ""'");  
		Если Остаток < 0 Тогда 
			Элементы.ДекорацияОперацияОстаток.ЦветТекста = WebЦвета.Красный;
		Иначе 
			Элементы.ДекорацияОперацияОстаток.ЦветТекста = WebЦвета.Зеленый;
		КонецЕсли;	
	Иначе 
		Элементы.ДекорацияОперацияОстаток.Заголовок = "";
	КонецЕсли;	
КонецПроцедуры	   

&НаКлиенте
Процедура КассовыеОперацииПриАктивизацииСтроки(Элемент)
	ОбновитьИнформациюОстатокОперации();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период = Новый СтандартныйПериод(ДатаНач, ДатаКон);
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтаФорма);
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт 
	Если Период = неопределено Тогда
		Возврат;
	КонецЕсли;	
	ДатаНач = Период.ДатаНачала;
    ДатаКон = Период.ДатаОкончания;
	Если НЕ ДатаКон = Дата(1,1,1) И НЕ ДатаНач = Дата(1,1,1) Тогда
		Если  ДатаКон < ДатаНач Тогда
			Предупреждение("Конечная дата выбранного периода не может быть больше начальной даты периода.", 60);
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	КассовыеОперации.Параметры.УстановитьЗначениеПараметра("Дата1", ?(ДатаНач = Дата(1,1,1), ДатаНач, НачалоДня(ДатаНач)));
	КассовыеОперации.Параметры.УстановитьЗначениеПараметра("Дата2", ?(ДатаКон = Дата(1,1,1), ДатаКон, КонецДня(ДатаКон)));	
	Элементы.КассовыеОперации.Обновить(); 
	ОстаткиПоКассе(); 
	ОбновитьИнформациюИтого();
	ОбновитьИнформациюОстатокОперации(); 
	ОбновитьИнформациюКассовойСмены();
	//+МАН 12.02.26
	ОбновитьКассовыйЛимит();
	ПроверитьПревышениеЛимита();
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.КассовыеОперации.Обновить(); 
	ОстаткиПоКассе();
	ОбновитьИнформациюИтого();
	ОбновитьИнформациюОстатокОперации(); 
	ОбновитьИнформациюКассовойСмены();
	//+МАН 12.02.26
	ОбновитьКассовыйЛимит();
	ПроверитьПревышениеЛимита();
	//-МАН
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьОткрытьКассовуюСмену(Дата = неопределено)   
	СтруктураВозврата = Новый Структура;
	
	ДатаПроверки = ?(Дата = неопределено, ТекущаяДатаСеанса(), Дата); 
    Результат = ЛБ_ОбщийМодуль.ПолучитьЗакрытыйКассовыйДень(ДатаПроверки, Организация, Ломбард);
	Если НЕ Результат = неопределено  тогда 
		Если (НачалоДня(Результат.КассовыйДень) = НачалоДня(ДатаПроверки)) Тогда 
			СтруктураВозврата.Вставить("Результат", Ложь); 
			СтруктураВозврата.Вставить("Сообщение", "Кассовый день " + Формат(Результат.КассовыйДень, "ДЛФ=D") + " в ломбарде закрыт!");
			Возврат СтруктураВозврата; 
		КонецЕсли;	
	КонецЕсли;	
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьТекущийСтатусКассовойСмены(ДатаПроверки, Организация, Ломбард);
	Если НЕ Результат = неопределено  тогда    
		СтатусКС = Результат.Статус; 
        Если СтатусКС = Перечисления.ЛБ_КассоваяСменаСтатус.Открыта Тогда
			СтруктураВозврата.Вставить("Результат", Ложь); 
			СтруктураВозврата.Вставить("Сообщение", "Нужно сначала завершить кассовую смену окрытую в ломбарде " + Формат(Результат.Дата, "ДЛФ=DT")+ "!");
			Возврат СтруктураВозврата;  
		КонецЕсли;	
	КонецЕсли;	       
	
	СтруктураВозврата.Вставить("Результат", Истина);
	Возврат СтруктураВозврата; 
КонецФункции	

&НаСервере
Функция ОткрытьКассовуюСменуНаСервере(Дата = неопределено)   
	СтруктураВозврата = Новый Структура; 
	
	ДатаОткрытия = ?(Дата = неопределено, ТекущаяДатаСеанса(), Дата);
	НоваяКС = Документы.ЛБ_ОперацииКассовойСмены.СоздатьДокумент(); 
	НоваяКС.Дата = ДатаОткрытия;
	НоваяКС.ВидОперации = Перечисления.ЛБ_ВидыОперацийКассовойСмены.Открыть;
	НоваяКС.Организация = Организация;
	НоваяКС.Ломбард = Ломбард; 
	Результат = ЛБ_ОбщийМодуль.ПолучитьСводныйПКО_РКО(ДатаОткрытия, Организация, Ломбард);  
	Если НЕ Результат = неопределено Тогда
		НоваяКС.СводныйПКО = Результат.ПКОСводный; 
		НоваяКС.СводныйРКО = Результат.РКОСводный;
	КонецЕсли;	
	НоваяКС.Ответственный = Ответственный;
	Попытка
	    НоваяКС.Записать(РежимЗаписиДокумента.Проведение);
		СтруктураВозврата.Вставить("Результат", Истина);
		Возврат СтруктураВозврата;
	Исключение  
		СтруктураВозврата.Вставить("Результат", Ложь); 
		СтруктураВозврата.Вставить("Сообщение", "Не удалось открыть кассовую смену. Обратитесь к администратору!");
		Возврат СтруктураВозврата;
	КонецПопытки;   
КонецФункции	

&НаКлиенте
Процедура ОткрытьКассовуюСмену(Команда)
	ВсеОК = Истина;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда  
		ВсеОК = Ложь;
		Сообщить("Не выбрана организация!");
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Ломбард) Тогда  
		ВсеОК = Ложь;
		Сообщить("Не выбран ломбард!");
	КонецЕсли;	

	Если ВсеОК тогда    
		Если СотрудникЦО Тогда
			ПараметрыФормы = Новый структура;
			ПараметрыФормы.Вставить("Дата", ПолучитьДатуСеанса());  
			//+МАН 24.04.25 Дабавил параметр т.к. его не указали при написании функционала. Заявка 2956
			ПараметрыФормы.Вставить("ОткрытиеЗакрытие", 0);
			//-МАН
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДатыОткрытияКС",ЭтаФорма);
			ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборДатыОткрытияЗакрытияКассовыхОпераций", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе	
			СтруктураВ = ПроверитьВозможностьОткрытьКассовуюСмену(); 
			Если СтруктураВ.Результат Тогда
			    Режим = РежимДиалогаВопрос.ДаНет;
			    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОткрыть", ЭтотОбъект, неопределено);
			    ПоказатьВопрос(Оповещение, "Внимание! Смена текущего дня на кассовом аппарате будет открыта. Продолжаем?" , Режим, 0); 
			Иначе
				Предупреждение(СтруктураВ.Сообщение, 60); 
			КонецЕсли;	 
		КонецЕсли;	
	КонецЕсли;   
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораДатыОткрытияКС(Результат, ДопПараметры) Экспорт
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВ = ПроверитьВозможностьОткрытьКассовуюСмену(Результат); 
	Если СтруктураВ.Результат Тогда
	    Режим = РежимДиалогаВопрос.ДаНет;
	    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОткрыть", ЭтотОбъект, Результат);
	    ПоказатьВопрос(Оповещение, "Внимание! Смена дня на кассовом аппарате будет открыта " + Формат(Результат, "ДЛФ=DT") + ". Продолжаем?" , Режим, 0); 
	Иначе
		Предупреждение(СтруктураВ.Сообщение, 60); 
	КонецЕсли;	 
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияВопросаОткрыть(Результат, ДатаОткрытия) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    СтруктураВ = ОткрытьКассовуюСменуНаСервере(ДатаОткрытия);
	Если СтруктураВ.Результат тогда
		ОстаткиПоКассе();                   
	    ОбновитьИнформациюИтого();
	    ОбновитьИнформациюКассовойСмены();
    Иначе 
	    Предупреждение(СтруктураВ.Сообщение, 60);
    КонецЕсли;	   
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьЗакрытьКассовуюСмену(Дата = неопределено)   
	СтруктураВозврата = Новый Структура;
	
	ДатаПроверки = ?(Дата = неопределено, ТекущаяДатаСеанса(), Дата);
	Результат  = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(ДатаПроверки, Организация, Ломбард);
	Если Результат = неопределено  тогда  
		СтруктураВозврата.Вставить("Результат", Ложь); 
		СтруктураВозврата.Вставить("Сообщение", "В ломбарде нет открытой кассовой смены!");
		Возврат СтруктураВозврата; 
	Иначе
		Запрос = новый Запрос; 
		Запрос.УстановитьПараметр("Дата", ДатаПроверки); 
		Запрос.УстановитьПараметр("КассоваяСмена", Результат.КассоваяСмена);
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	ЛБ_ДвиженияДенежныхСредств.Период КАК Период
	                   |ИЗ
	                   |	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
	                   |ГДЕ
	                   |	ЛБ_ДвиженияДенежныхСредств.Период > &Дата
	                   |	И ЛБ_ДвиженияДенежныхСредств.КассоваяСмена = &КассоваяСмена
	                   |
	                   |УПОРЯДОЧИТЬ ПО
	                   |	Период УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			СтруктураВозврата.Вставить("Результат", Ложь);  
			СообщениеП = "В ломбарде есть операции по открытой кассовой смене " + Формат(Результат.Дата, "ДЛФ=DT") + " на более позднюю дату.";
			Если НЕ Дата = неопределено Тогда 
				СообщениеП = СообщениеП + Символы.ПС + "Кассовую смену можно закрыть на " + Формат(Выборка.Период + 1, "ДЛФ=DT"); 
			КонецЕсли;	
			СтруктураВозврата.Вставить("Сообщение", СообщениеП);
			Возврат СтруктураВозврата; 
		КонецЕсли;	
	КонецЕсли;	       
	СтруктураВозврата.Вставить("Результат", Истина);
	Возврат СтруктураВозврата;
КонецФункции	

&НаСервере
Функция ЗакрытьКассовуюСменуНаСервере(Дата = неопределено)   
	СтруктураВозврата = Новый Структура; 
	
	ДатаЗакрытия = ?(Дата = неопределено, ТекущаяДатаСеанса(), Дата);	
	НоваяКС = Документы.ЛБ_ОперацииКассовойСмены.СоздатьДокумент(); 
	НоваяКС.Дата = ДатаЗакрытия;
	НоваяКС.ВидОперации = Перечисления.ЛБ_ВидыОперацийКассовойСмены.Закрыть;
	НоваяКС.Организация = Организация;
	НоваяКС.Ломбард = Ломбард;
	НоваяКС.Ответственный = Ответственный;
	Попытка
	    НоваяКС.Записать(РежимЗаписиДокумента.Проведение);
		СтруктураВозврата.Вставить("Результат", Истина);
		Возврат СтруктураВозврата;
	Исключение  
		СтруктураВозврата.Вставить("Результат", Ложь); 
		СтруктураВозврата.Вставить("Сообщение", "Не удалось закрыть кассовую смену. Обратитесь к администратору!");
		Возврат СтруктураВозврата;
	КонецПопытки;   
КонецФункции	

&НаКлиенте
Процедура ЗакрытьКассовуюСмену(Команда)
	ВсеОК = Истина;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда  
		ВсеОК = Ложь;
		Сообщить("Не выбрана организация!");
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Ломбард) Тогда  
		ВсеОК = Ложь;
		Сообщить("Не выбран ломбард!");
	КонецЕсли;	
	
	Если ВсеОК тогда   
		Если СотрудникЦО Тогда
			ПараметрыФормы = Новый структура;
			ПараметрыФормы.Вставить("Дата", ПолучитьДатуСеанса());  
			//+МАН 24.04.25 Дабавил параметр т.к. его не указали при написании функционала. Заявка 2956
			ПараметрыФормы.Вставить("ОткрытиеЗакрытие", 1);
			//-МАН
			ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораДатыЗакрытияКС",ЭтаФорма);
			ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборДатыОткрытияЗакрытияКассовыхОпераций", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		    СтруктураВ = ПроверитьВозможностьЗакрытьКассовуюСмену();   
		Иначе	      
			СтруктураВ = ПроверитьВозможностьЗакрытьКассовуюСмену();
			Если СтруктураВ.Результат Тогда
			    Режим = РежимДиалогаВопрос.ДаНет;
			    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗакрыть", ЭтотОбъект, неопределено);
			    ПоказатьВопрос(Оповещение, "Внимание! Смена текущего дня на кассовом аппарате будет закрыта. Продолжаем?" , Режим, 0);
			Иначе
				Предупреждение(СтруктураВ.Сообщение, 60); 
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;   
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораДатыЗакрытияКС(Результат, ДопПараметры) Экспорт
	Если Результат = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВ = ПроверитьВозможностьЗакрытьКассовуюСмену(Результат); 
	Если СтруктураВ.Результат Тогда
	    Режим = РежимДиалогаВопрос.ДаНет;   
	    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗакрыть", ЭтотОбъект, Результат);
	    ПоказатьВопрос(Оповещение, "Внимание! Смена дня на кассовом аппарате будет закрыта " + Формат(Результат, "ДЛФ=DT") + ". Продолжаем?" , Режим, 0); 
	Иначе
		Предупреждение(СтруктураВ.Сообщение, 60); 
	КонецЕсли;	 
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияВопросаЗакрыть(Результат, ДатаЗакрытия) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    СтруктураВ = ЗакрытьКассовуюСменуНаСервере(ДатаЗакрытия);
	Если СтруктураВ.Результат тогда
		ОстаткиПоКассе();                   
	    ОбновитьИнформациюИтого();
	    ОбновитьИнформациюКассовойСмены();
    Иначе 
	    Предупреждение(СтруктураВ.Сообщение, 60);
    КонецЕсли;	    
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВПротоколРаботы()
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийСотрудник) и ЗначениеЗаполнено(ПараметрыСеанса.ТекущийЛомбард) Тогда
		МенеджерЗаписи = РегистрыСведений.ЛБ_ПротоколРаботы.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.Сотрудник 	= ПараметрыСеанса.ТекущийСотрудник; 
		МенеджерЗаписи.Дата 		= ТекущаяДата(); 
		МенеджерЗаписи.Ломбард 		= ПараметрыСеанса.ТекущийЛомбард; 
		МенеджерЗаписи.Действие 	= Перечисления.ЛБ_ДействияПользователя.Выход;
		МенеджерЗаписи.Записать(); 		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗакрытьКассовыйДеньНаСервере() 
	СтруктураВозврата = Новый Структура;
   
	НоваяКС = Документы.ЛБ_ОперацииКассовойСмены.СоздатьДокумент(); 
	НоваяКС.Дата = ТекущаяДатаСеанса();
	НоваяКС.ВидОперации = Перечисления.ЛБ_ВидыОперацийКассовойСмены.ЗакрытьКассовыйДень;
	НоваяКС.Организация = Организация;           
	НоваяКС.Ломбард = Ломбард;
	НоваяКС.Ответственный = Ответственный;
	Попытка
	    НоваяКС.Записать(РежимЗаписиДокумента.Проведение);
		СтруктураВозврата.Вставить("Результат", Истина);
		Возврат СтруктураВозврата;
	Исключение  
		СтруктураВозврата.Вставить("Результат", Ложь); 
		СтруктураВозврата.Вставить("Сообщение", "Не удалось закрыть кассоый день. Обратитесь к администратору!");
		Возврат СтруктураВозврата;
	КонецПопытки;   
КонецФункции	

&НаСервере
Функция ПроверитьВозможностьЗакрытьКассовыйДень()   
	СтруктураВозврата = Новый Структура;
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьТекущийСтатусКассовойСмены(ТекущаяДатаСеанса(), Организация, Ломбард);
	Если НЕ Результат = неопределено Тогда 
		СтатусКС = Результат.Статус;
		Если СтатусКС = Перечисления.ЛБ_КассоваяСменаСтатус.Открыта  тогда  
			СтруктураВозврата.Вставить("Результат", Ложь); 
			СтруктураВозврата.Вставить("Сообщение", "Необходимо закрыть открытую кассовую смену!");
			Возврат СтруктураВозврата;
		ИначеЕсли СтатусКС = Перечисления.ЛБ_КассоваяСменаСтатус.КассовыйДеньЗакрыт  тогда  
			СтруктураВозврата.Вставить("Результат", Ложь); 
			СтруктураВозврата.Вставить("Сообщение", "Кассовый день " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT") + " уже закрыт!");
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЕсли;	
	
	СтруктураВозврата.Вставить("Результат", Истина);
	Возврат СтруктураВозврата;
 КонецФункции	


&НаКлиенте
Процедура ЗакрытьКассовыйДень(Команда)
	ВсеОК = Истина;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда  
		ВсеОК = Ложь;
		Сообщить("Не выбрана организация!");
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Ломбард) Тогда  
		ВсеОК = Ложь;
		Сообщить("Не выбран ломбард!");
	КонецЕсли;	
	
	//+МАН 12.02.26
	Если ПроверитьПревышениеЛимита(Истина) Тогда
		ВсеОК = Ложь;
	КонецЕсли;
	//-МАН
	
	Если ВсеОК тогда   
		СтруктураВ = ПроверитьВозможностьЗакрытьКассовыйДень(); 
		Если СтруктураВ.Результат Тогда		
			Режим = РежимДиалогаВопрос.ДаНет;
		    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗакрытьКассовыйДень", ЭтотОбъект, Параметры);
		    ПоказатьВопрос(Оповещение, "Внимание! Текущий день на кассовом аппарате будет закрыт. Продолжаем?" , Режим, 0);  
		Иначе   
			Предупреждение(СтруктураВ.Сообщение, 60);
		КонецЕсли;	
	КонецЕсли;   
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗакрытьКассовыйДень(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    СтруктураВ = ЗакрытьКассовыйДеньНаСервере();
	Если СтруктураВ.Результат тогда  
		ОстаткиПоКассе();                   
	    ОбновитьИнформациюИтого();
	    ОбновитьИнформациюКассовойСмены();
		ЗаписатьВПротоколРаботы();//Савранин 14.05.25
    Иначе 
	    Предупреждение(СтруктураВ.Сообщение, 60);
    КонецЕсли;	    
КонецПроцедуры


&НаСервере
Функция ПроверитьВозвможностьОтмены(Документ) 
	ВсеОк = Ложь;  
	СтруктураВ = Новый Структура;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КассоваяОперация", Документ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДвиженияДенежныхСредствОбороты.СуммаОборот КАК СуммаОборот
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств.Обороты(, , , КассоваяОперация = &КассоваяОперация) КАК ЛБ_ДвиженияДенежныхСредствОбороты";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.СуммаОборот > 0 Тогда
			ВсеОк = Истина;
		КонецЕсли;	
	КонецЕсли;	          
	Если Не ВсеОК Тогда
		СтруктураВ.Вставить("Результат", Ложь);  
		СтруктураВ.Вставить("Сообщение", "Кассовая операция уже отменена");  
		Возврат структураВ;
	КонецЕсли;	
	Если (ТекущаяДатаСеанса() - Документ.Дата) > 3600 Тогда
		СтруктураВ.Вставить("Результат", Ложь);  
		СтруктураВ.Вставить("Сообщение", "Отменяемая кассовая операция создана больше часа назад. Отмена запрещена.");  
		Возврат структураВ;
    КонецЕсли;
	СтруктураВ.Вставить("Результат", Истина);   
	Возврат структураВ;

КонецФункции

&НаКлиенте
Процедура ОтменитьРКО(Документ)
	Если НЕ ПроверитьПроведен(Документ) Тогда  
		Предупреждение("Текущий документ не проведен.", 60);  
		Возврат;
	КонецЕсли;      
	Если НЕ ПроверитьМожноОтменить(Документ) тогда
		Предупреждение("Нельзя отменять кассовые операции без чеков.", 60);  
		Возврат;
	КонецЕсли;	
	СтруктураВ = ПроверитьВозвможностьОтмены(Документ);
	Если НЕ СтруктураВ.Результат Тогда 
		Предупреждение(СтруктураВ.Сообщение, 60);  
		Возврат;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("РКО", Документ);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_ОтменаРКО.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПКО(Документ)	
	Если НЕ ПроверитьПроведен(Документ) Тогда  
		Предупреждение("Текущий документ не проведен.", 60);  
		Возврат;
	КонецЕсли; 
	Если НЕ ПроверитьМожноОтменить(Документ) тогда  
		Предупреждение("Нельзя отменять кассовые операции без чеков.", 60);  
		Возврат;
	КонецЕсли;	
	СтруктураВ = ПроверитьВозвможностьОтмены(Документ);
	Если НЕ СтруктураВ.Результат Тогда 
		Предупреждение(СтруктураВ.Сообщение, 60);  
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("ПКО", Документ);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыполненияОперации",ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_ОтменаПКО.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры	  

&НаСервере
Функция ПроверитьПроведен(Документ) 
	Возврат ?(Документ.Проведен, Истина, Ложь);
КонецФункции		

&НаСервере
Функция ПроверитьМожноОтменить(Документ) 
	Если Документ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ОприходованиеИзлишков") ИЛИ
		 Документ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПриходныеОперацииПоСогласованиюСЦО") ИЛИ 
		 Документ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратПроцентов") ИЛИ 
		 Документ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратПроцентовПоЗаявке") ИЛИ
		 Документ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратРазницыРеализацииНевостребованногоЗалога") ИЛИ 
		 Документ.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.РасходныеОперацииПоСогласованиюСЦО") Тогда   
		Возврат Истина; 
	КонецЕсли;	
    Возврат Ложь;
КонецФункции		

&НаКлиенте
Процедура ОтменитьКассовуюОперацию(Команда) 
	ТекСтрока = Элементы.КассовыеОперации.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда   
		СтруктураРез = ПроверитьКассовыйДеньЗакрыт(ТекСтрока.Регистратор); 
		Если СтруктураРез.Результат Тогда  
			Предупреждение(СтруктураРез.Сообщение, 60);
		    Возврат;
		КонецЕсли;	
		Если ПолучитьТипДокумента(ТекСтрока.Регистратор) = 1 И ПроверитьПроведен(ТекСтрока.Регистратор) Тогда		
			ОтменитьПКО(ТекСтрока.Регистратор);
		ИначеЕсли ПолучитьТипДокумента(ТекСтрока.Регистратор) = 2 И ПроверитьПроведен(ТекСтрока.Регистратор) Тогда     
			ОтменитьРКО(ТекСтрока.Регистратор);	 
		Иначе 
            Предупреждение("Можно отменить только проведенный приходный или расходный кассовый ордер.", 60);
	    КонецЕсли;	  
    КонецЕсли;
КонецПроцедуры

#Область ЭДО

&НаКлиенте
Процедура ПечатьОтчетОбЭДО(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода", ДатаНач);
	ПараметрыОтчета.Вставить("КонецПериода", ДатаКон);
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("Ломбард", Ломбард);
	
	ЛБ_СоглашенияЭДОКлиент.ОбработкаКоманд(Команда.Имя, ,,ПараметрыОтчета, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКассовыйЛист(Команда)
	Если НачалоДня(ДатаНач) = НачалоДня(ДатаКон) Тогда
		ПараметрыОтчета = Новый Структура;
		ПараметрыОтчета.Вставить("Период", ДатаНач);
		ПараметрыОтчета.Вставить("Организация", Организация);
		ПараметрыОтчета.Вставить("Ломбард", Ломбард);
		ЛБ_ЖурналКассовыхДокументовКлиент.ОбработкаКоманд(Команда.Имя, ПараметрыОтчета);
	Иначе
		Сообщить("Печать кассового листа за период невозможна! Выберите нужную дату и запустите печать отчета за дату.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтчетДДС(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода", НачалоДня(ДатаНач));
	ПараметрыОтчета.Вставить("КонецПериода", КонецДня(ДатаКон));
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("Ломбард", Ломбард);
	ЛБ_ЖурналКассовыхДокументовКлиент.ОбработкаКоманд(Команда.Имя, ПараметрыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтчетОплатаБилетовВДругихЛомбардах(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода", НачалоДня(ДатаНач));
	ПараметрыОтчета.Вставить("КонецПериода", КонецДня(ДатаКон));
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("Ломбард", Ломбард);
	ЛБ_ЖурналКассовыхДокументовКлиент.ОбработкаКоманд(Команда.Имя, ПараметрыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтчетВыданныеСОХ(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода", НачалоДня(ДатаНач));
	ПараметрыОтчета.Вставить("КонецПериода", КонецДня(ДатаКон));
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("Ломбард", Ломбард);
	ЛБ_ЖурналКассовыхДокументовКлиент.ОбработкаКоманд(Команда.Имя, ПараметрыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЖурналДвиженияДМ(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода", НачалоДня(ДатаНач));
	ПараметрыОтчета.Вставить("КонецПериода", КонецДня(ДатаКон));
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("Ломбард", Ломбард);
	ЛБ_ЖурналКассовыхДокументовКлиент.ОбработкаКоманд(Команда.Имя, ПараметрыОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПакетОтчетов(Команда)
	//ордер
	//Печать(Неопределено);
	//остальные
	//+МАН 15.12.25 Для заполнения заголовка
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Период", НачалоДня(ДатаНач) <> НачалоДня(ДатаКон));
	ПараметрыФормы.Вставить("ДатаНач", НачалоДня(ДатаНач));
	ПараметрыФормы.Вставить("ДатаКон", НачалоДня(ДатаКон));
	//-МАН
	
	ОписаниеОповещенияПечатьПакетОтчетовПродолжить = Новый ОписаниеОповещения("ПечатьПакетОтчетовПродолжить", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПечатьПакетаОтчетов", ПараметрыФормы,,,,,ОписаниеОповещенияПечатьПакетОтчетовПродолжить, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПакетОтчетовПродолжить(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ПараметрыОтчета = Новый Структура;
		ПараметрыОтчета.Вставить("Период", НачалоДня(ДатаНач));
		ПараметрыОтчета.Вставить("НачалоПериода", НачалоДня(ДатаНач));
		ПараметрыОтчета.Вставить("КонецПериода", КонецДня(ДатаКон));
		ПараметрыОтчета.Вставить("Организация", Организация);
		ПараметрыОтчета.Вставить("Ломбард", Ломбард);
		Если Результат Тогда
			ЛБ_ЖурналКассовыхДокументовКлиент.ОбработкаКоманд("ПечатьПакетОтчетов", ПараметрыОтчета);
		Иначе
			ЛБ_ЖурналКассовыхДокументовКлиент.ОбработкаКоманд("ПечатьПакетОтчетовПросмотр", ПараметрыОтчета);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтчетОСогласиях(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода", ДатаНач);
	ПараметрыОтчета.Вставить("КонецПериода", ДатаКон);
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("Ломбард", Ломбард);
	
	ЛБ_СогласияНаИнформированиеКлиент.ОбработкаКоманд(Команда.Имя, ,,ПараметрыОтчета, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

//+МАН 12.02.26
&НаСервере
Процедура ОбновитьКассовыйЛимит()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит КАК ФактическийЛимит
		|ИЗ
		|	РегистрСведений.ЛБ_КассовыеЛимиты.СрезПоследних(&ДатаКон, Ломбард = &Ломбард) КАК ЛБ_КассовыеЛимитыСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаКон", ?(ДатаКон = Дата(1,1,1), ТекущаяДатаСеанса(), КонецДня(ДатаКон)));
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		КассовыйЛимит = РезультатЗапроса.ФактическийЛимит;
		Элементы.ТекстЛимит.Заголовок = "" + Формат(КассовыйЛимит, "ЧДЦ=2");
	Иначе
		КассовыйЛимит = 0;
		Элементы.ТекстЛимит.Заголовок = Формат(0, "ЧДЦ=2");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПревышениеЛимита(ЗакрытьДень = Ложь)
	Если ЗакрытьДень Тогда
		ВыходнойДень = ПроверитьНаПраздничныйИлиВыходной();
		
		Если ВыходнойДень = Неопределено Тогда
			Предупреждение("Не указан производственный календарь для лимитов.",, "Внимание!");
			Возврат Истина;
		КонецЕсли;

		Если ВыходнойДень = "Удаление" Тогда
			Предупреждение("Производственный календарь для лимитов помечен на удаление.
							| Выберите другой произвдственный каленрь или снимите отметку удаления.",, "Внимание!");
			Возврат Истина;
		КонецЕсли;
		
		Если НЕ ВыходнойДень И КассовыйЛимит - СуммаКон <= 0 Тогда
			Предупреждение("Кассовый лимит превышен на " + Формат((СуммаКон - КассовыйЛимит), "ЧДЦ=2") + " руб.",, "Внимание!");
			Возврат Истина;
		КонецЕсли;
	Иначе
		Если КассовыйЛимит - СуммаКон <= 0 Тогда
			Предупреждение("Кассовый лимит превышен на " + Формат((СуммаКон - КассовыйЛимит), "ЧДЦ=2") + " руб.",, "Внимание!");
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

&НаСервере
Функция ПроверитьНаПраздничныйИлиВыходной()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ПраздничныеСокращенныеДни.Дата КАК Дата,
		|	ЛБ_ПраздничныеСокращенныеДни.Выходной КАК Выходной,
		|	ЛБ_ПраздничныеСокращенныеДни.ВремяНачала КАК ВремяНачала,
		|	ЛБ_ПраздничныеСокращенныеДни.ВремяОкончания КАК ВремяОкончания,
		|	ЛБ_ПраздничныеСокращенныеДни.ЧасовСокращено КАК ЧасовСокращено,
		|	ЛБ_ПраздничныеСокращенныеДни.РабочийДень КАК РабочийДень
		|ИЗ
		|	Справочник.ЛБ_ПраздничныеСокращенныеДни КАК ЛБ_ПраздничныеСокращенныеДни
		|ГДЕ
		|	ЛБ_ПраздничныеСокращенныеДни.Дата = &Дата
		|	И НЕ ЛБ_ПраздничныеСокращенныеДни.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата", Формат(ДатаКон, "ДФ=dd.MM.yyyy"));
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Константы.ЛБ_ПроизводственныйКалендарьДляЛимитов.Получить()) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Константы.ЛБ_ПроизводственныйКалендарьДляЛимитов.Получить()) Тогда
		Если Константы.ЛБ_ПроизводственныйКалендарьДляЛимитов.Получить().ПометкаУдаления Тогда
			Возврат "Удаление";
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
		|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|	И ДанныеПроизводственногоКалендаря.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаКон)); //Формат(ДатаКон, "ДФ=dd.MM.yyyy"));
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", Константы.ЛБ_ПроизводственныйКалендарьДляЛимитов.Получить());
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Если РезультатЗапроса.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий
			ИЛИ РезультатЗапроса.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЛБ_РабочиеДниЛомбардаСрезПоследних.Период КАК Период,
	//	|	ЛБ_РабочиеДниЛомбардаСрезПоследних.Ломбард КАК Ломбард,
	//	|	ЛБ_РабочиеДниЛомбардаСрезПоследних.Выходной КАК Выходной,
	//	|	ЛБ_РабочиеДниЛомбардаСрезПоследних.ДеньНедели КАК ДеньНедели,
	//	|	ЛБ_РабочиеДниЛомбардаСрезПоследних.НомерДня КАК НомерДня
	//	|ИЗ
	//	|	РегистрСведений.ЛБ_РабочиеДниЛомбарда.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_РабочиеДниЛомбардаСрезПоследних";
	//
	//Запрос.УстановитьПараметр("Дата", ДатаКон);
	//Запрос.УстановитьПараметр("Ломбард", Ломбард);
	//
	//РезультатЗапроса = Запрос.Выполнить().Выбрать();
	//
	//Если РезультатЗапроса.Следующий() Тогда
	//	Если РезультатЗапроса.Выходной ИЛИ РезультатЗапроса.НомерДня = 6 ИЛИ РезультатЗапроса.НомерДня = 7 Тогда
	//		Возврат Истина;
	//	КонецЕсли;
	//КонецЕсли;

	Возврат Ложь;
	
КонецФункции

//+МАН 19.03.26 Заявка 3750
&НаСервере
Процедура УстановитьДоступность()
	
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.Ломбард.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Организация.ТолькоПросмотр = Ложь;
		Элементы.Ломбард.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры
//-МАН
